Ran Plan for dir: `.` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default/default.tfplan"' in '/atlantis-data/repos/bbl232/homelab-k3s-base-services/3/default': exit status 1
module.metallb-system.kubernetes_manifest.namespace_metallb_system: Refreshing state...
module.dashboard.kubernetes_namespace_v1.kube_dashboard: Refreshing state... [id=kubernetes-dashboard]
module.atlantis.kubernetes_namespace_v1.namespace: Refreshing state... [id=atlantis-system]
module.traefik_config.kubernetes_manifest.traefik_entrypoints: Refreshing state...
module.omada_controller.kubernetes_namespace_v1.omada_controller: Refreshing state... [id=omada-controller]
module.pihole_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.cert-manager.kubernetes_manifest.namespace_cert_manager: Refreshing state...
module.pihole_system.kubernetes_manifest.middleware_ipallowlist: Refreshing state...
module.authentik_system.kubernetes_manifest.certificate_authentik_auth_billv_ca: Refreshing state...
module.authentik_system.kubernetes_manifest.ingressroute: Refreshing state...
module.pihole_system.kubernetes_manifest.assistant_ingressroute: Refreshing state...
module.authentik_system.random_password.authentik_secret_key: Refreshing state... [id=none]
module.pihole_system.kubernetes_manifest.middleware_admin: Refreshing state...
module.authentik_system.random_password.akadmin_password: Refreshing state... [id=none]
module.longhorn_system.kubernetes_namespace.longhorn_system: Refreshing state... [id=longhorn-system]
module.longhorn_system.kubernetes_manifest.recurringjob_longhorn_system_daily_backup: Refreshing state...
kubernetes_service_account_v1.bill: Refreshing state... [id=default/bill]
module.pihole_system.data.kubernetes_service_v1.traefik: Reading...
module.authentik_system.kubernetes_manifest.certificate_authentik_star_billv_ca: Refreshing state...
module.pihole_system.kubernetes_manifest.ingressroute: Refreshing state...
kubernetes_secret_v1.bill_token: Refreshing state... [id=default/bill-token]
module.pihole_system.kubernetes_manifest.certificate_piholeassistant_billv_ca: Refreshing state...
kubernetes_service_account_v1.test: Refreshing state... [id=default/test]
module.authentik_system.random_password.akadmin_api_key: Refreshing state... [id=none]
module.authentik_system.random_password.postgresql_password: Refreshing state... [id=none]
module.atlantis.aws_iam_user.atlantis: Refreshing state... [id=atlantis]
module.atlantis.data.aws_ssm_parameter.atlantis-secret: Reading...
module.atlantis.data.aws_ssm_parameter.atlantis-key: Reading...
module.longhorn_system.aws_iam_user.longhorn: Refreshing state... [id=longhorn]
module.authentik_system.data.aws_ssm_parameter.smtp: Reading...
module.longhorn_system.aws_s3_bucket.longhorn_backups: Refreshing state... [id=longhorn-backups.billv.ca]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.longhorn_system.aws_s3_bucket.longhorn_backups will be created
  + resource "aws_s3_bucket" "longhorn_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "longhorn-backups.billv.ca"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: Get "http://localhost/api/v1/namespaces/default/serviceaccounts/bill": dial tcp [::1]:80: connect: connection refused
│ 
│   with kubernetes_service_account_v1.bill,
│   on main.tf line 63, in resource "kubernetes_service_account_v1" "bill":
│   63: resource "kubernetes_service_account_v1" "bill" {
│ 
╵
╷
│ Error: Get "http://localhost/api/v1/namespaces/default/serviceaccounts/test": dial tcp [::1]:80: connect: connection refused
│ 
│   with kubernetes_service_account_v1.test,
│   on main.tf line 69, in resource "kubernetes_service_account_v1" "test":
│   69: resource "kubernetes_service_account_v1" "test" {
│ 
╵
╷
│ Error: Get "http://localhost/api/v1/namespaces/default/secrets/bill-token": dial tcp [::1]:80: connect: connection refused
│ 
│   with kubernetes_secret_v1.bill_token,
│   on main.tf line 90, in resource "kubernetes_secret_v1" "bill_token":
│   90: resource "kubernetes_secret_v1" "bill_token" {
│ 
╵
╷
│ Error: Get "http://localhost/api/v1/namespaces/atlantis-system": dial tcp [::1]:80: connect: connection refused
│ 
│   with module.atlantis.kubernetes_namespace_v1.namespace,
│   on modules/atlantis-system/main.tf line 15, in resource "kubernetes_namespace_v1" "namespace":
│   15: resource "kubernetes_namespace_v1" "namespace" {
│ 
╵
╷
│ Error: reading SSM Parameter (/runatlantis/key): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: f9a8d6cb-4465-405f-9be3-ced2e2ed711b, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/key because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.atlantis.data.aws_ssm_parameter.atlantis-key,
│   on modules/atlantis-system/main.tf line 21, in data "aws_ssm_parameter" "atlantis-key":
│   21: data "aws_ssm_parameter" "atlantis-key" {
│ 
╵
╷
│ Error: reading SSM Parameter (/runatlantis/webhook-secret): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: e08516b0-0e53-4537-bbc8-ac14d9c36d3c, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/webhook-secret because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.atlantis.data.aws_ssm_parameter.atlantis-secret,
│   on modules/atlantis-system/main.tf line 25, in data "aws_ssm_parameter" "atlantis-secret":
│   25: data "aws_ssm_parameter" "atlantis-secret" {
│ 
╵
╷
│ Error: reading IAM User (atlantis): operation error IAM: GetUser, https response error StatusCode: 403, RequestID: fef5634b-d383-4ddf-ad51-fb213f21fe44, api error AccessDenied: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: iam:GetUser on resource: user atlantis because no identity-based policy allows the iam:GetUser action
│ 
│   with module.atlantis.aws_iam_user.atlantis,
│   on modules/atlantis-system/main.tf line 29, in resource "aws_iam_user" "atlantis":
│   29: resource "aws_iam_user" "atlantis" {
│ 
╵
╷
│ Error: reading SSM Parameter (zoho-smtp-creds): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: b3d9e33e-1683-42f8-b587-97fa6e291b15, api error AccessDeniedException: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: ssm:GetParameter on resource: arn:aws:ssm:us-east-1:398183381961:parameter/zoho-smtp-creds because no identity-based policy allows the ssm:GetParameter action
│ 
│   with module.authentik_system.data.aws_ssm_parameter.smtp,
│   on modules/authentik-system/main.tf line 15, in data "aws_ssm_parameter" "smtp":
│   15: data "aws_ssm_parameter" "smtp" {
│ 
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.authentik_system.kubernetes_manifest.certificate_authentik_star_billv_ca,
│   on modules/authentik-system/main.tf line 102, in resource "kubernetes_manifest" "certificate_authentik_star_billv_ca":
│  102: resource "kubernetes_manifest" "certificate_authentik_star_billv_ca" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.authentik_system.kubernetes_manifest.certificate_authentik_auth_billv_ca,
│   on modules/authentik-system/main.tf line 125, in resource "kubernetes_manifest" "certificate_authentik_auth_billv_ca":
│  125: resource "kubernetes_manifest" "certificate_authentik_auth_billv_ca" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.authentik_system.kubernetes_manifest.ingressroute,
│   on modules/authentik-system/main.tf line 147, in resource "kubernetes_manifest" "ingressroute":
│  147: resource "kubernetes_manifest" "ingressroute" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.cert-manager.kubernetes_manifest.namespace_cert_manager,
│   on modules/cert-manager/main.tf line 1, in resource "kubernetes_manifest" "namespace_cert_manager":
│    1: resource "kubernetes_manifest" "namespace_cert_manager" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Get "http://localhost/api/v1/namespaces/kubernetes-dashboard": dial tcp [::1]:80: connect: connection refused
│ 
│   with module.dashboard.kubernetes_namespace_v1.kube_dashboard,
│   on modules/dashboard-system/main.tf line 12, in resource "kubernetes_namespace_v1" "kube_dashboard":
│   12: resource "kubernetes_namespace_v1" "kube_dashboard" {
│ 
╵
╷
│ Error: Get "http://localhost/api/v1/namespaces/longhorn-system": dial tcp [::1]:80: connect: connection refused
│ 
│   with module.longhorn_system.kubernetes_namespace.longhorn_system,
│   on modules/longhorn-system/main.tf line 15, in resource "kubernetes_namespace" "longhorn_system":
│   15: resource "kubernetes_namespace" "longhorn_system" {
│ 
╵
╷
│ Error: reading IAM User (longhorn): operation error IAM: GetUser, https response error StatusCode: 403, RequestID: 28010573-92a9-4287-9099-af79f183f6f4, api error AccessDenied: User: arn:aws:iam::398183381961:user/system/atlantis is not authorized to perform: iam:GetUser on resource: user longhorn because no identity-based policy allows the iam:GetUser action
│ 
│   with module.longhorn_system.aws_iam_user.longhorn,
│   on modules/longhorn-system/main.tf line 25, in resource "aws_iam_user" "longhorn":
│   25: resource "aws_iam_user" "longhorn" {
│ 
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.longhorn_system.kubernetes_manifest.recurringjob_longhorn_system_daily_backup,
│   on modules/longhorn-system/main.tf line 142, in resource "kubernetes_manifest" "recurringjob_longhorn_system_daily_backup":
│  142: resource "kubernetes_manifest" "recurringjob_longhorn_system_daily_backup" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.metallb-system.kubernetes_manifest.namespace_metallb_system,
│   on modules/metallb-system/main.tf line 1, in resource "kubernetes_manifest" "namespace_metallb_system":
│    1: resource "kubernetes_manifest" "namespace_metallb_system" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Get "http://localhost/api/v1/namespaces/omada-controller": dial tcp [::1]:80: connect: connection refused
│ 
│   with module.omada_controller.kubernetes_namespace_v1.omada_controller,
│   on modules/omada-controller/main.tf line 9, in resource "kubernetes_namespace_v1" "omada_controller":
│    9: resource "kubernetes_namespace_v1" "omada_controller" {
│ 
╵
╷
│ Error: Get "http://localhost/api/v1/namespaces/kube-system/services/traefik": dial tcp [::1]:80: connect: connection refused
│ 
│   with module.pihole_system.data.kubernetes_service_v1.traefik,
│   on modules/pihole-system/main.tf line 12, in data "kubernetes_service_v1" "traefik":
│   12: data "kubernetes_service_v1" "traefik" {
│ 
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.pihole_system.kubernetes_manifest.certificate_authentik_star_billv_ca,
│   on modules/pihole-system/main.tf line 77, in resource "kubernetes_manifest" "certificate_authentik_star_billv_ca":
│   77: resource "kubernetes_manifest" "certificate_authentik_star_billv_ca" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.pihole_system.kubernetes_manifest.middleware_admin,
│   on modules/pihole-system/main.tf line 98, in resource "kubernetes_manifest" "middleware_admin":
│   98: resource "kubernetes_manifest" "middleware_admin" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.pihole_system.kubernetes_manifest.middleware_ipallowlist,
│   on modules/pihole-system/main.tf line 114, in resource "kubernetes_manifest" "middleware_ipallowlist":
│  114: resource "kubernetes_manifest" "middleware_ipallowlist" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.pihole_system.kubernetes_manifest.ingressroute,
│   on modules/pihole-system/main.tf line 135, in resource "kubernetes_manifest" "ingressroute":
│  135: resource "kubernetes_manifest" "ingressroute" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.pihole_system.kubernetes_manifest.certificate_piholeassistant_billv_ca,
│   on modules/pihole-system/main.tf line 168, in resource "kubernetes_manifest" "certificate_piholeassistant_billv_ca":
│  168: resource "kubernetes_manifest" "certificate_piholeassistant_billv_ca" {
│ 
│ cannot create discovery client: no client config
╵
╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.traefik_config.kubernetes_manifest.traefik_entrypoints,
│   on modules/traefik-config/main.tf line 1, in resource "kubernetes_manifest" "traefik_entrypoints":
│    1: resource "kubernetes_manifest" "traefik_entrypoints" {
│ 
│ cannot create discovery client: no client config
╵


Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on main.tf line 9, in provider "kubernetes":
   9: provider "kubernetes" {

'config_path' refers to an invalid path: "/home/atlantis/.kube/config": stat
/home/atlantis/.kube/config: no such file or directory

╷
│ Error: Failed to get RESTMapper client
│ 
│   with module.pihole_system.kubernetes_manifest.assistant_ingressroute,
│   on modules/pihole-system/main.tf line 189, in resource "kubernetes_manifest" "assistant_ingressroute":
│  189: resource "kubernetes_manifest" "assistant_ingressroute" {
│ 
│ cannot create discovery client: no client config
╵

```
</details>